# Задача 1(выходные)
day_num = int(input("Введите номер дня "))
if day_num == 6 or day_num == 7:
    print("День выходной")
else:
    print("День рабочий")
