# Задача 4 (по четверти диапазон координат)
num = int(input("Введите номер четверти "))
if num == 1:
    print("X = (1 to inf) Y = (1 to inf)")
elif num == 2:
    print("X = (-1 to inf) Y = (1 to inf)")
elif num == 3:
    print("X = (-1 to inf) Y = (-1 to inf)")
elif num == 4:
    print("X = (1 to inf) Y = (-1 to inf)")
